* SQL Implementation
#+PROPERTY: header-args:sql :engine postgresql :cmdline "service=zones" :tangle yes

DO $$ plv8.elog(NOTICE, "hello there!"); $$ LANGUAGE plv8;

#+BEGIN_SRC sql
DO $$ return "hello"; $$ LANGUAGE plv8;
#+END_SRC

#+RESULTS:
| DO |
|----|

#+BEGIN_SRC sql
CREATE FUNCTION plv8_test(keys TEXT[], vals TEXT[]) RETURNS JSON AS $$
    var o = {};
    for(var i=0; i<keys.length; i++){
        o[keys[i]] = vals[i];
    }
    return o;
$$ LANGUAGE plv8 IMMUTABLE STRICT;
#+END_SRC

#+RESULTS:
| CREATE FUNCTION |
|-----------------|

#+BEGIN_SRC sql
SELECT plv8_test(ARRAY['name', 'age'], ARRAY['Tom', '29']);
#+END_SRC

#+RESULTS:
| plv8_test                 |
|---------------------------|
| {"name":"Tom","age":"29"} |

#+BEGIN_SRC sql
CREATE or replace function init_injector(prefix text,js text)
RETURNS TEXT
LANGUAGE PLPGSQL AS $PL$
begin
EXECUTE FORMAT($FORMAT$
CREATE OR REPLACE FUNCTION require_%1$s() RETURNS VOID AS $INIT_FUNCTION$
%2$s
$INIT_FUNCTION$ LANGUAGE plv8 IMMUTABLE STRICT;
$FORMAT$,prefix,js);
return 'require_'||prefix;
end
$PL$;

#+END_SRC

#+RESULTS:
| CREATE FUNCTION |
|-----------------|
